In [1]:
import numpy as np
from pandas import DataFrame,Series
import pandas as pd

In [5]:
s1=Series(np.arange(3),index=['a','b','c'])

In [6]:
s1

a    0
b    1
c    2
dtype: int32

In [7]:
s1['a']

0

In [8]:
s1[2]

2

In [10]:
s1['b']

1

In [11]:
s1[s1>1]

c    2
dtype: int32

In [12]:
s1[['a','b']]

a    0
b    1
dtype: int32

In [13]:
s1*2

a    0
b    2
c    4
dtype: int32

In [14]:
s1

a    0
b    1
c    2
dtype: int32

In [15]:
s1=s1*4

In [16]:
s1

a    0
b    4
c    8
dtype: int32

In [46]:
df1=DataFrame(np.arange(25).reshape((5,5)),index=['Cal','PH','Enu','Uyo','Los'], columns=['A','B','C','D','E'])

In [25]:
df1

      A   B   C   D   E
Cal   0   1   2   3   4
PH    5   6   7   8   9
Enu  10  11  12  13  14
Uyo  15  16  17  18  19
Los  20  21  22  23  24

In [31]:
df1.loc['PH']

A    5
B    6
C    7
D    8
E    9
Name: PH, dtype: int32

In [36]:
df1['B']

Cal     1
PH      6
Enu    11
Uyo    16
Los    21
Name: B, dtype: int32

In [37]:
df1[['B','A']]

      B   A
Cal   1   0
PH    6   5
Enu  11  10
Uyo  16  15
Los  21  20

In [38]:
df1.loc[['Los','Cal']]

      A   B   C   D   E
Los  20  21  22  23  24
Cal   0   1   2   3   4

In [39]:
df1 = df1>10

In [40]:
df1

         A      B      C      D      E
Cal  False  False  False  False  False
PH   False  False  False  False  False
Enu  False   True   True   True   True
Uyo   True   True   True   True   True
Los   True   True   True   True   True

In [47]:
df1

      A   B   C   D   E
Cal   0   1   2   3   4
PH    5   6   7   8   9
Enu  10  11  12  13  14
Uyo  15  16  17  18  19
Los  20  21  22  23  24

In [48]:
df1[df1>10]

        A     B     C     D     E
Cal   NaN   NaN   NaN   NaN   NaN
PH    NaN   NaN   NaN   NaN   NaN
Enu   NaN  11.0  12.0  13.0  14.0
Uyo  15.0  16.0  17.0  18.0  19.0
Los  20.0  21.0  22.0  23.0  24.0

In [49]:
df1[df1['C']>5]

      A   B   C   D   E
PH    5   6   7   8   9
Enu  10  11  12  13  14
Uyo  15  16  17  18  19
Los  20  21  22  23  24

In [51]:
df1.ix[2]

C:\Users\abelu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

A    10
B    11
C    12
D    13
E    14
Name: Enu, dtype: int32

In [52]:
df1.iloc[2]

A    10
B    11
C    12
D    13
E    14
Name: Enu, dtype: int32